Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: To display and change the libnet configuration run the libnetcfg command.
es_es: Para mostrar y modificar la configuración de libnet, ejecute el comando libnetcfg.

source: $search .= "}";
es_es: $buscar .= "}";

source: This means that $foo and @foo are two different variables.
es_es: Significa entonces que $foo y @foo son dos variables distintas.

source: Also note that
es_es: También tenga en cuenta que

source: or die "Can't start sort: $!";
es_es: or die "No puedo iniciar sort: $!";

source: Of course, the shortest way to do the above is:
es_es: Por supuesto, el camino más corto para hacer lo anterior es:

source: See L<perlfaq8> for details.
es_es: Vea L<perlfaq8> para más detalles.

source: File types such as terminals may lose the end-of-file condition if you do.
es_es: Tipos de archivos como por ejemplo terminales pueden perder la condición de fin-de-archivo si lo hace.

source: The loop
es_es: El bucle

source: Here is a script that saves, redirects, and restores C<STDOUT> and C<STDERR> using various methods:
es_es: Aquí hay un script que salva, redirecciona, y restaura C<STDOUT> y C<STDERR> usando varios métodos:

source: This solves a number of misparsing issues when a global C<_> subroutine is defined.
es_es: Esto soluciona una serie de cuestiones de mala interpretación cuando esté definida una subrutina global C<_>.

source: It's often used to remove the newline from the end of an input record when you're worried that the final record may be missing its newline.
es_es: Se utiliza a menudo para eliminar el carácter de nueva línea del final de un registro de entrada cuando es importante que el registro al final le pueda faltar ese carácter.

source: This way, you can define a set of regular expression rules that can be bundled into any pattern you choose.
es_es: De esta manera, puede definir un conjunto de reglas de expresiones regulares que pueden ser agrupadas en el patrón que usted elija.

source: C<FindBin> now works better with directories where access rights are more restrictive than usual.
es_es: C<FindBin> ahora funciona mejor con los directorios donde los derechos de acceso sean más restrictivos de lo habitual.

source: That is, change "^" and "$" from matching the start or end of the string to matching the start or end of any line anywhere within the string.
es_es: Es decir, cambia "^" y "$" de coincidir con el inicio y el final de la cadena a coincidir con el inicio y el final de cualquier línea en cualquier lugar dentro de la cadena.

source: # wipe out *all* compile-time warnings
es_es: # limpiar *todas* las advertencias en tiempo de compilación

source: If your platform supports NaNs (not-a-numbers) as numeric values, using them with "<=>" returns undef.
es_es: Si su plataforma es compatible con NaN (I<not-anumbers>, no-es-un-número) como valores numéricos, usándolos con "<=>" devuelve undef.

source: %p a pointer (outputs the Perl value's address in hexadecimal)
es_es: %p un puntero (sale la dirección del valor Perl en hexadecimal)

source: As your reader continues through the document, they should receive a progressively greater amount of knowledge.
es_es: A medida que el lector siga a través del documento, debe recibir una cantidad cada vez mayor de conocimientos.

source: =item eval EXPR X<eval> X<try> X<catch> X<evaluate> X<parse> X<execute> X<error, handling> X<exception, handling>
es_es: =item eval EXPR X<eval> X<try> X<catch> X<evaluate> X<parse> X<execute> X<error, handling> X<exception, handling> X<manejo de excepciones> X<interpretar>

source: ^ start of string
es_es: ^ principio de una cadena

source: Resets only package variables; lexical variables are unaffected, but they clean themselves up on scope exit anyway, so you'll probably want to use them instead.
es_es: Restablece sólo las variables del paquete; las variables léxicas no se ven afectadas, pero ellas mismas se limpiarán, de todos modos, a la salida de su ámbito, por lo que probablemente querrá usarlas en su lugar.

source: If you actually want to test if at least one of C<$a> and C<$b> is defined, use C<defined($a // $b)>.
es_es: Si realmente desea probar si al menos uno de los dos, C<$a> o C<$b>, están definidos, use C<defined($a // $b)>.

source: =head2 Malloc in Irix
es_es: =head2 Malloc en Irix

source: perlopentut Perl open() tutorial
es_es: perlopentut Tutorial de open()

# print "false " if (8 | 2) != 10;
source: print "false\n" if (8 | 2) != 10;
es_es: print "falso\n" if (8 | 2) != 10;

source: # am the child; use STDIN/STDOUT normally
es_es: # soy el hijo; use STDIN/STDOUT de forma normal

source: The ISO 8859-6 conversion table has been corrected (the 0x30..0x39 erroneously mapped to U+0660..U+0669, instead of U+0030..U+0039).
es_es: La tabla de conversión ISO 8859-6 ha sido corregida (el 0x30..0x39 erróneamente estaba asignado a U+0660..U+0669, en lugar de U+0030..U+0039).

source: The version strings or v-strings (see L<perldata/"Version Strings">) feature introduced in Perl 5.6.0 has been a source of some confusion-- especially when the user did not want to use it, but Perl thought it knew better.
es_es: Las cadenas de versión o v-strings (vea L<perldata/"Cadenas de versión"> ), característica introducida en Perl 5.6.0, ha sido una fuente de confusión -especialmente cuando el usuario no desea utilizarla, pero Perl piensa que sabe más que él-.

source: As usual, some optimizations took place and made the math overall a tad faster.
es_es: Como de costumbre, algunas optimizaciones se llevaron a cabo y se hizo que el proceso matemático fuera, en general, un poco más rápido.

source: because you'll get just references listed, and perl will never automatically dereference things for you.
es_es: porque solo va a conseguir un listado de referencias, y perl nunca desreferencia de forma automática.

source: Arrays are zero-indexed.
es_es: El índice de un array empieza en cero.

source: See L<http://www.unicode.org/versions/Unicode5.1.0/#Notable_Changes> for the notable changes.
es_es: Vea L<http://www.unicode.org/versions/Unicode5.1.0/#Notable_Changes> para consultar los cambios principales.

source: That's why sometimes is easier to take a temporary on your way through:
es_es: Es por eso que a veces es más fácil tomar un descanso en su marcha campo a través:

source: OPSTRING must be a packed array of semop structures.
es_es: OPSTRING debe ser un array empaquetado de estructuras semop.

source: Space after last parenthesis matching on current line.
es_es: Espacio después del último paréntesis coincidente en la línea actual.

source: The C<\U>, C<\u>, C<\L>, and C<\l> string-interpolation escapes on the right side of a substitution operator will perform correct case-mappings, but C<tr[a-z][A-Z]> will not (except sometimes on legacy 7-bit data).
es_es: Las secuencias de escapado en la interpolación de cadenas (C<\U>, C<\u>, C<\L>, y C<\l>) en el lado derecho de un operador de sustitución realizará un correcto mapeado entre mayúsculas y minúsculas, pero C<tr[a-z][A-Z]>, no (excepto en algunos viejos sistemas de 7 bits).

source: $days[28] # the 29th element of array @days
es_es: $dias[28] # el elemento número 29 del array @dias

source: This was due to incorrect UTF8 offsets being cached, and is now fixed.
es_es: Esto se debió a que se almacenaban desplazamientos UTF8 incorrectos, y ahora ya está arreglado.

source: For example in the latter case the test is trying to send a UDP ping to the IP address 127.0.0.1.
es_es: Un ejemplo de la última prueba sería la de intentar enviar un ping UDP a la dirección IP 127.0.0.1.

source: At the moment the hints file for VM/ESA basically bypasses all of the automatic configuration process.
es_es: En este momento el archivo de sugerencias para VM/ESA, básicamente, pasa por alto todo el proceso de configuración automática.

source: For B<sed> devotees, C<y> is provided as a synonym for C<tr>.
es_es: Para los devotos de B<sed>, C<y> se ofrece como un sinónimo de C<tr>.

source: /i matching so that no ASCII character will match a non-ASCII
es_es: coincidencia de /i de forma que ningún carácter ASCII coincida con ningún no ASCII

source: =head3 Custom matching via overloading
es_es: =head3 Coincidencia personalizada vía sobrecarga del operador

source: The filehandle behaves normally for the parent, but I/O to that filehandle is piped from/to the STDOUT/STDIN of the child process.
es_es: El identificador de archivo se comporta de forma normal para el padre, pero la E/S del identificador de archivo es entubada desde/hacia el STDOUT/STDIN del proceso hijo.

source: The major changes made in 5.12.0 are described in L<perl5120delta>.
es_es: Los principales cambios realizados en 5.12.0 se describen en L<perl5120delta>.

source: FUNCTION RETURN LISTS
es_es: LISTAS RETORNO FUNCIONES

source: This feature was planned a long time ago, but wasn't quite working until now.
es_es: Esta característica fue planeada hace mucho tiempo, pero no estuvo funcionando hasta ahora.

source: What happens for any of these other characters currently though, is that the value is derived by inverting the 7th bit (0x40).
es_es: Sin embargo, lo que le sucede ahora, para cualquiera de estos otros caracteres, es que el valor se obtiene invirtiendo el bit 7 (0x40).

source: s/\s+$//; # trim trailing whitespace
es_es: s/\s+$//; # quita los últimos espacios en blanco

source: When doing a lookup in %ENV from within Perl, the elements are combined into a single value.
es_es: Al hacer una búsqueda en %ENV desde dentro de Perl, los elementos son combinados en un solo valor.

source: For an alternation like this, an array ref will work, because this will instigate smart matching:
es_es: Para una alternativa como ésta, una referencia a un array funcionará, porque esto lanzará a la coincidencia inteligente:

source: Our earlier example, C<$days{'Feb'}> can be written as C<$days{Feb}> and the quotes will be assumed automatically.
es_es: En un ejemplo anterior, C<$dias{'Feb'}> puede ser escrito como C<$dias{Feb}> y las comillas serán asumidas automáticamente.

source: The C<goto>-LABEL form finds the statement labeled with LABEL and resumes execution there.
es_es: La forma C<goto>-ETIQUETA busca la instrucción etiquetada con ETIQUETA y continua la ejecución desde allí.

source: Simple methods for simple tasks
es_es: Métodos sencillos para tareas sencillas

source: Setuid scripts have additional constraints that can produce error messages such as "Insecure dependency".
es_es: Los scripts setuid tienen restricciones adicionales que pueden producir mensajes de error como "Insecure dependency" (dependencia insegura).

source: =item q/STRING/ X<q> X<quote, single> X<'> X<''>
es_es: =item q/CADENA/ X<q> X<quote, single> X<'> X<''> X<comilla, simple>

source: Note that the notion of "line" used here is whatever you may have defined with C<$/> or C<$INPUT_RECORD_SEPARATOR>).
es_es: Note que la noción de "línea" usada aquí es según tenga definido C<$/> o C<$INPUT_RECORD_SEPARATOR>.

source: UTF-8 treats the first 128 codepoints, 0..127, the same as ASCII.
es_es: En UTF-8 los primeros 128 códigos de carácter (0 a 127) son equivalentes a ASCII.

source: In the output, the only failures you should see should look like:
es_es: En la salida, los únicos errores que debe ver deben ser similares a:

source: =head2 (Win32) The -C Switch Has Been Repurposed
es_es: =head2 (Win32) La opción -C ha sido reasignada

source: Open returns nonzero on success, the undefined value otherwise.
es_es: open() devuelve un valor distinto de cero en caso de éxito, indefinido en otro caso.

source: searches
es_es: búsquedas

source: However, if all deleted elements fall at the end of an array, the array's size shrinks to the position of the highest element that still tests true for exists(), or to 0 if none do.
es_es: Sin embargo, si todos los elementos eliminados están al final del array, el tamaño del array se reduce al de la posición del elemento más alto que aún devuelve verdadero para exists(), o 0 si no hay ninguno.

source: or to block until something becomes ready just do this
es_es: o bloquear hasta que algo esté preparado, sólo hacemos esto

source: Basically, Intel and VAX CPUs are little-endian, while everybody else, including Motorola m68k/88k, PPC, Sparc, HP PA, Power, and Cray, are big-endian.
es_es: Básicamente, Intel y VAX son little-endian, mientras que todos los demás, incluyendo Motorola m68k/88k, PPC, Sparc, HP PA, Power y Cray, son big-endian.

source: ! sSlLiI Forces native (short, long, int) sizes instead of fixed (16-/32-bit) sizes.
es_es: ! sSlLiI Fuerza a tamaños nativos (short, long, int) en lugar de tamaños fijos (16/32 bit)

source: printf '<%f>', 1; # prints "<1.000000>"
es_es: printf '<%f>', 1; # imprime "<1.000000>"

source: Updated to version 2.126.
es_es: Actualizado a la versión 2.126.

source: Several fixes, for example for join() problems and memory leaks.
es_es: Varias correcciones, por ejemplo para problemas y pérdidas de memoria en join().

source: Used without arguments in scalar context, reverse() reverses C<$_>.
es_es: Si se utiliza sin argumentos en contexto escalar, reverse() invierte C<$_>.

source: -f File is a plain file.
es_es: -f Archivo es un archivo normal.

source: See L<perlvar> for a description of Perl's built-in variables and a discussion of legal variable names.
es_es: Ver L<perlvar> para una descripción de las variables internas de Perl y una discusión de nombres de variables legales.

source: $hexdigit = (0 ..
es_es: $hexdigito = (0 ..

source: Read L<perlboot>, L<perltoot>, L<perltooc> and L<perlobj>.
es_es: Lea L<perlboot>, L<perltoot>, L<perltooc> y L<perlobj> para obtener más información.

source: my $result = $num * $num;
es_es: my $resultado = $num * $num;

source: =head2 Compilation improvements
es_es: =head2 Mejoras en la compilación

source: Dogmatically advocating anything tends to make people discount your message.
es_es: En cambio, si defiende sus ideas de manera dogmática, hará que las personas desconfíen de su mensaje.

source: If the file named by FILENAME does not exist and the C<open> call creates it (typically because MODE includes the C<O_CREAT> flag), then the value of PERMS specifies the permissions of the newly created file.
es_es: Si el archivo con el nombre ARCHIVO no existe y la llamada C<open> lo crea (por lo general porque el modo incluye la bandera C<O_CREAT>), entonces el valor de PERMISOS especifica los permisos del archivo recién creado.

source: Matches C<yes-pattern> if C<condition> yields a true value, matches C<no-pattern> otherwise.
es_es: Busca el C<patrón-sí> si C<condición> devuelve un valor verdadero, sino, busca el patrón C<patrón-no>.

source: # this sorts the %age hash by value instead of key
es_es: # esto ordena el hash %edad por valor en lugar de por clave

source: The expression providing the return value is evaluated in void, scalar, or list context, depending on the context of the C<eval> itself.
es_es: La expresión que da el valor de retorno es evaluada en contexto vacío (void), escalar o lista, dependiendo del contexto en que se encuentre el C<eval>.

source: default { say '$foo does not contain a y' }
es_es: default { say '$foo no contiene una y' }

source: ($uid, $dir) = (getpwnam("daemon"))[2,7]; # list slice
es_es: ($uid, $dir) = (getpwnam("daemon"))[2,7]; # porción lista

source: (Although case 2 has misleading double quotes making the reader wonder what else might be happening (nothing is).) Cases 3 and 4 likewise behave in the same way: they run the code C<'$x'>, which does nothing but return the value of $x.
es_es: (Aunque el caso 2 tiene unas engañosas dobles comillas haciendo maravillar al lector de qué es lo que que puede pasar -que es nada-). Los casos 3 y 4 se comportan de la misma manera: ejecutan el código C<'$x'>, que no hace nada excepto devolver el valor de $x.

source: One may also use pod directives to quickly comment out a section of code.
es_es: Uno puede también usar directivas pod para comentar, de forma rápida, una sección de código.

source: A class implementing a filehandle should have the following methods:
es_es: Una clase que implementa un identificador de archivo debe tener los siguientes métodos:

source: The following all do the same thing:
es_es: Todo lo siguiente hace lo mismo:

source: To read more about them check their respective manual pages at L<strict> and L<warnings>.
es_es: Para obtener más información, consulte las páginas de manual correspondientes a L<strict> y L<warnings>.

source: Options (specified by the following modifiers) are:
es_es: Opciones (especificado por los siguientes modificadores) son:

source: ( Start of a ()-group.
es_es: ( Inicia un grupo ().

source: These URLs might also be useful:
es_es: Las siguientes direcciones URL también pueden resultarle de utilidad:

source: The C<p> format packs a pointer to a null-terminated string.
es_es: El formato C<p> empaqueta un puntero a una cadena terminada en nulo.

source: local *FH; # not my!
es_es: local *FH; # ¡no my!

source: Beginning with v5.6.0, Perl will attempt to flush all files opened for output before starting the child process, but this may not be supported on some platforms (see L<perlport>).
es_es: A partir de la versión v5.6.0, Perl intentará vaciar todos los archivos abiertos para salida antes de iniciar un proceso hijo, pero esto puede no estar soportado en todas las plataformas (ver L<perlport>).

source: When using perl on VM/ESA please keep in mind that the EBCDIC and ASCII character sets are different.
es_es: Cuando se utiliza perl en VM/ESA por favor, tenga en cuenta que los juegos de caracteres EBCDIC y ASCII son diferentes.

source: Don't fall into the trap of writing for the wrong audience.
es_es: No caiga en la trampa de escribir para el público equivocado.

source: Use L</exists> for the latter purpose.
es_es: Use L</exists> para este propósito.

source: If the operands C<$a> and C<$b> are floating point values and the absolute value of C<$b> (that is C<abs($b)>) is less than C<(UV_MAX + 1)>, only the integer portion of C<$a> and C<$b> will be used in the operation (Note: here C<UV_MAX> means the maximum of the unsigned integer type).
es_es: Si los operandos C<$a> y C<$b> son valores en punto flotante y el valor absoluto de C<$b> (es decir, C<abs($b)>) es menor que C<(UV_MAX + 1)>, solo la porción de entero de C<$a> y C<$b> será usada en la operación (Nota: aquí C<UV_MAX> significa el máximo valor del tipo entero sin signo).

source: Note that whether C<select> gets restarted after signals (say, SIGALRM) is implementation-dependent.
es_es: Tenga en cuenta que cuando C<select> es reiniciado después de señales (por ejemplo, SIGALRM) es algo dependiente de la implementación.

source: =item Any good book on software engineering
es_es: =item Cualquier buen libro de ingeniería del software

source: Before Perl knew how to execute interpolated code within a pattern, this operation was completely safe from a security point of view, although it could raise an exception from an illegal pattern.
es_es: Antes de que Perl supiera cómo ejecutar código interpolado dentro de un patrón, esta operación era completamente segura desde un punto de vista de la seguridad, aunque podría levantar una excepción si se pasa un patrón ilegal.

source: Any Hash hash entry existence exists $b->{$a}
es_es: Cualquiera Hash existencia de un valor hash exists $b->{$a}

source: A position of zero is returned as the string C<"0 but true">; thus C<sysseek> returns true on success and false on failure, yet you can still easily determine the new position.
es_es: Una posición de cero es devuelto como cadena C<"0 but true"> (I<"0 pero verdadero">), por lo que C<sysseek> devuelve verdadero o falso en caso de error, sin embargo, usted puede determinar fácilmente la nueva posición.

source: Some programmers choose to use an explicit conversion so as to leave nothing to doubt:
es_es: Algunos programadores eligen usar una conversión explícita para que no haya ninguna duda:

source: Use the C<-a> option to run I<all> tests.
es_es: Use la opción C<-a> para correr I<todas> las pruebas.

source: state $prettily = new Dumpvalue::
es_es: state $bellamente = new Dumpvalue::

source: %x an unsigned integer, in hexadecimal
es_es: %x un entero sin signo, en hexadecimal

source: Whitespace mostly serves to separate tokens, unlike languages like Python where it is an important part of the syntax.
es_es: El espacio en blanco sirve para separar los elementos, a diferencia de lenguajes como Python donde es una parte importante de la sintaxis.

source: This form of loading of modules does not risk altering your namespace.
es_es: Esta forma de cargar módulos no tiene el riesgo de alterar el espacio de nombres propio.

source: Variable substitution inside strings is limited to scalar variables, arrays, and array or hash slices.
es_es: Sustitución de variables dentro de cadenas se limita a variables escalares, arrays y porciones de array y hash.

source: Taints the variable.
es_es: Contamina la variable.

source: Returns the numeric (the native 8-bit encoding, like ASCII or EBCDIC, or Unicode) value of the first character of EXPR.
es_es: Devuelve el valor numérico (en la codificación nativa de 8 bits, como ASCII o EBCDIC, o Unicode) del primer carácter de EXPR.

source: That is, C<$year> is C<123> in year 2023.
es_es: Es decir, $anno es C<123> para el año 2023.

source: Use the new C<-a> option to run I<all> tests.
es_es: Use la nueva opción C<-a> para correr I<todas> las pruebas.

source: perl5120delta Perl changes in version 5.12.0
es_es: perl5120delta Cambios en la versión 5.12.0

source: However, contrary to 5.10.0, evaluating the flip-flop operators in boolean context ensures it can now be useful in a C<when()>, notably for implementing bistable conditions, like in:
es_es: Sin embargo, contrariamente a 5.10.0, la evaluación de los operadores flip-flop en contexto booleano asegura que ahora puede ser útil en un C<when()>, especialmente para implementar condiciones biestable, como en:

source: More details can be found in L<PerlIO::encoding>.
es_es: Más detalles se pueden encontrar en L<PerlIO::encoding>.

source: ISBN 978-0-596-52010-6 [5th edition June 2008]
es_es: ISBN 978-0-596-52010-6 [5ª edición - Junio de 2008]

source: 200) { print; } # print $_ 100 times
es_es: 200) { print; } # imprime $_ 100 veces

source: =item If C<use bytes> is in effect:
es_es: =item Si C<use bytes> está activo:

source: Unless otherwise documented, it returns C<1> for true and C<''> for false, or the undefined value if the file doesn't exist.
es_es: Mientras no se diga lo contrario, se devuelve C<1> para verdadero y C<''> para falso, o el valor indefinido si el archivo no existe.

source: $kid = waitpid(-1, WNOHANG);
es_es: $hijo = waitpid(-1, WNOHANG);

source: As you see, this can be a bit tricky.
es_es: Como puede ver, puede ser un poco complicado.

source: This is seldom what you want.
es_es: Es muy raro que quiera hacerlo.

source: See also discussion of list operators in L<Terms and List Operators (Leftward)>.
es_es: Vea también la discusión de los Operadores de lista en L<Términos y Operadores de listas (por la izquierda)>.

source: $str =~ /^\w/; # No match, as $str isn't in UTF-8 format.
es_es: $str =~ /^\w/; # No coincide, porque $str no está en formato UTF-8.

source: Never release anything (even a one-word documentation patch) without incrementing the number.
es_es: Nunca lance nada (ni siquiera un parche de documentación de una sola palabra) sin incrementar el número.

source: eval "$x"; # CASE 2
es_es: eval "$x"; # CASO 2

source: =head2 Stability
es_es: =head2 Estabilidad

source: You'll have to check their respective release notes to see just what the differences are.
es_es: Para averiguar cuáles son las diferencias, consulte las notas de la versión correspondiente.
